AoA_15/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    
    outlet
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    
    airfoilInternal
    {
        type            zeroGradient;
    }
    
    airfoilExternal
    {
        type            zeroGradient;
    }
    
    externalWalls
    {
        type            zeroGradient;
        
    }
    
    frontAndBack
    {
        type            zeroGradient;
        
    }

    avion
    {
    type            zeroGradient;  // o fixedValue dependiendo del caso
    }
}

// ************************************************************************* //